{
    "name": "model",
    "layers": [
        {
            "class_name": "InputLayer",
            "config": {
                "batch_input_shape": [
                    null,
                    null,
                    4
                ],
                "dtype": "float32",
                "sparse": false,
                "ragged": false,
                "name": "input_1"
            },
            "name": "input_1",
            "inbound_nodes": []
        },
        {
            "class_name": "Conv1D",
            "config": {
                "name": "conv1d",
                "trainable": true,
                "dtype": "float32",
                "filters": 64,
                "kernel_size": [
                    25
                ],
                "strides": [
                    1
                ],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [
                    1
                ],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "VarianceScaling",
                    "config": {
                        "scale": 2.0,
                        "mode": "fan_in",
                        "distribution": "truncated_normal",
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": {
                    "class_name": "L1L2",
                    "config": {
                        "l1": 0.0,
                        "l2": 9.999999747378752e-05
                    }
                },
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "name": "conv1d",
            "inbound_nodes": [
                [
                    [
                        "input_1",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "BatchNormalization",
            "config": {
                "name": "batch_normalization",
                "trainable": true,
                "dtype": "float32",
                "axis": [
                    2
                ],
                "momentum": 0.99,
                "epsilon": 0.001,
                "center": true,
                "scale": true,
                "beta_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "gamma_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "moving_mean_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "moving_variance_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "beta_regularizer": null,
                "gamma_regularizer": null,
                "beta_constraint": null,
                "gamma_constraint": null
            },
            "name": "batch_normalization",
            "inbound_nodes": [
                [
                    [
                        "conv1d",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Dropout",
            "config": {
                "name": "dropout",
                "trainable": true,
                "dtype": "float32",
                "rate": 0.1,
                "noise_shape": null,
                "seed": null
            },
            "name": "dropout",
            "inbound_nodes": [
                [
                    [
                        "batch_normalization",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Conv1D",
            "config": {
                "name": "conv1d_1",
                "trainable": true,
                "dtype": "float32",
                "filters": 32,
                "kernel_size": [
                    20
                ],
                "strides": [
                    1
                ],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [
                    1
                ],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "VarianceScaling",
                    "config": {
                        "scale": 2.0,
                        "mode": "fan_in",
                        "distribution": "truncated_normal",
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": {
                    "class_name": "L1L2",
                    "config": {
                        "l1": 0.0,
                        "l2": 9.999999747378752e-05
                    }
                },
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "name": "conv1d_1",
            "inbound_nodes": [
                [
                    [
                        "dropout",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "BatchNormalization",
            "config": {
                "name": "batch_normalization_1",
                "trainable": true,
                "dtype": "float32",
                "axis": [
                    2
                ],
                "momentum": 0.99,
                "epsilon": 0.001,
                "center": true,
                "scale": true,
                "beta_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "gamma_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "moving_mean_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "moving_variance_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "beta_regularizer": null,
                "gamma_regularizer": null,
                "beta_constraint": null,
                "gamma_constraint": null
            },
            "name": "batch_normalization_1",
            "inbound_nodes": [
                [
                    [
                        "conv1d_1",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Dropout",
            "config": {
                "name": "dropout_1",
                "trainable": true,
                "dtype": "float32",
                "rate": 0.1,
                "noise_shape": null,
                "seed": null
            },
            "name": "dropout_1",
            "inbound_nodes": [
                [
                    [
                        "batch_normalization_1",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Conv1D",
            "config": {
                "name": "conv1d_2",
                "trainable": true,
                "dtype": "float32",
                "filters": 32,
                "kernel_size": [
                    20
                ],
                "strides": [
                    1
                ],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [
                    1
                ],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "VarianceScaling",
                    "config": {
                        "scale": 2.0,
                        "mode": "fan_in",
                        "distribution": "truncated_normal",
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": {
                    "class_name": "L1L2",
                    "config": {
                        "l1": 0.0,
                        "l2": 9.999999747378752e-05
                    }
                },
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "name": "conv1d_2",
            "inbound_nodes": [
                [
                    [
                        "dropout_1",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Conv1D",
            "config": {
                "name": "conv1d_3",
                "trainable": true,
                "dtype": "float32",
                "filters": 32,
                "kernel_size": [
                    20
                ],
                "strides": [
                    1
                ],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [
                    1
                ],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "VarianceScaling",
                    "config": {
                        "scale": 2.0,
                        "mode": "fan_in",
                        "distribution": "truncated_normal",
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": {
                    "class_name": "L1L2",
                    "config": {
                        "l1": 0.0,
                        "l2": 9.999999747378752e-05
                    }
                },
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "name": "conv1d_3",
            "inbound_nodes": [
                [
                    [
                        "dropout",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "BatchNormalization",
            "config": {
                "name": "batch_normalization_2",
                "trainable": true,
                "dtype": "float32",
                "axis": [
                    2
                ],
                "momentum": 0.99,
                "epsilon": 0.001,
                "center": true,
                "scale": true,
                "beta_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "gamma_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "moving_mean_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "moving_variance_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "beta_regularizer": null,
                "gamma_regularizer": null,
                "beta_constraint": null,
                "gamma_constraint": null
            },
            "name": "batch_normalization_2",
            "inbound_nodes": [
                [
                    [
                        "conv1d_2",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "BatchNormalization",
            "config": {
                "name": "batch_normalization_3",
                "trainable": true,
                "dtype": "float32",
                "axis": [
                    2
                ],
                "momentum": 0.99,
                "epsilon": 0.001,
                "center": true,
                "scale": true,
                "beta_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "gamma_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "moving_mean_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "moving_variance_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "beta_regularizer": null,
                "gamma_regularizer": null,
                "beta_constraint": null,
                "gamma_constraint": null
            },
            "name": "batch_normalization_3",
            "inbound_nodes": [
                [
                    [
                        "conv1d_3",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Dropout",
            "config": {
                "name": "dropout_2",
                "trainable": true,
                "dtype": "float32",
                "rate": 0.1,
                "noise_shape": null,
                "seed": null
            },
            "name": "dropout_2",
            "inbound_nodes": [
                [
                    [
                        "batch_normalization_2",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Dropout",
            "config": {
                "name": "dropout_3",
                "trainable": true,
                "dtype": "float32",
                "rate": 0.1,
                "noise_shape": null,
                "seed": null
            },
            "name": "dropout_3",
            "inbound_nodes": [
                [
                    [
                        "batch_normalization_3",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Add",
            "config": {
                "name": "add",
                "trainable": true,
                "dtype": "float32"
            },
            "name": "add",
            "inbound_nodes": [
                [
                    [
                        "dropout_2",
                        0,
                        0,
                        {}
                    ],
                    [
                        "dropout_3",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Conv1D",
            "config": {
                "name": "conv1d_4",
                "trainable": true,
                "dtype": "float32",
                "filters": 32,
                "kernel_size": [
                    15
                ],
                "strides": [
                    1
                ],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [
                    1
                ],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "VarianceScaling",
                    "config": {
                        "scale": 2.0,
                        "mode": "fan_in",
                        "distribution": "truncated_normal",
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": {
                    "class_name": "L1L2",
                    "config": {
                        "l1": 0.0,
                        "l2": 9.999999747378752e-05
                    }
                },
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "name": "conv1d_4",
            "inbound_nodes": [
                [
                    [
                        "add",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "BatchNormalization",
            "config": {
                "name": "batch_normalization_4",
                "trainable": true,
                "dtype": "float32",
                "axis": [
                    2
                ],
                "momentum": 0.99,
                "epsilon": 0.001,
                "center": true,
                "scale": true,
                "beta_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "gamma_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "moving_mean_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "moving_variance_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "beta_regularizer": null,
                "gamma_regularizer": null,
                "beta_constraint": null,
                "gamma_constraint": null
            },
            "name": "batch_normalization_4",
            "inbound_nodes": [
                [
                    [
                        "conv1d_4",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Dropout",
            "config": {
                "name": "dropout_4",
                "trainable": true,
                "dtype": "float32",
                "rate": 0.1,
                "noise_shape": null,
                "seed": null
            },
            "name": "dropout_4",
            "inbound_nodes": [
                [
                    [
                        "batch_normalization_4",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Conv1D",
            "config": {
                "name": "conv1d_5",
                "trainable": true,
                "dtype": "float32",
                "filters": 32,
                "kernel_size": [
                    15
                ],
                "strides": [
                    1
                ],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [
                    1
                ],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "VarianceScaling",
                    "config": {
                        "scale": 2.0,
                        "mode": "fan_in",
                        "distribution": "truncated_normal",
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": {
                    "class_name": "L1L2",
                    "config": {
                        "l1": 0.0,
                        "l2": 9.999999747378752e-05
                    }
                },
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "name": "conv1d_5",
            "inbound_nodes": [
                [
                    [
                        "dropout_4",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "BatchNormalization",
            "config": {
                "name": "batch_normalization_5",
                "trainable": true,
                "dtype": "float32",
                "axis": [
                    2
                ],
                "momentum": 0.99,
                "epsilon": 0.001,
                "center": true,
                "scale": true,
                "beta_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "gamma_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "moving_mean_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "moving_variance_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "beta_regularizer": null,
                "gamma_regularizer": null,
                "beta_constraint": null,
                "gamma_constraint": null
            },
            "name": "batch_normalization_5",
            "inbound_nodes": [
                [
                    [
                        "conv1d_5",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Dropout",
            "config": {
                "name": "dropout_5",
                "trainable": true,
                "dtype": "float32",
                "rate": 0.1,
                "noise_shape": null,
                "seed": null
            },
            "name": "dropout_5",
            "inbound_nodes": [
                [
                    [
                        "batch_normalization_5",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Add",
            "config": {
                "name": "add_1",
                "trainable": true,
                "dtype": "float32"
            },
            "name": "add_1",
            "inbound_nodes": [
                [
                    [
                        "dropout_5",
                        0,
                        0,
                        {}
                    ],
                    [
                        "add",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Conv1D",
            "config": {
                "name": "conv1d_6",
                "trainable": true,
                "dtype": "float32",
                "filters": 32,
                "kernel_size": [
                    15
                ],
                "strides": [
                    1
                ],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [
                    1
                ],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "VarianceScaling",
                    "config": {
                        "scale": 2.0,
                        "mode": "fan_in",
                        "distribution": "truncated_normal",
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": {
                    "class_name": "L1L2",
                    "config": {
                        "l1": 0.0,
                        "l2": 9.999999747378752e-05
                    }
                },
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "name": "conv1d_6",
            "inbound_nodes": [
                [
                    [
                        "add_1",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "BatchNormalization",
            "config": {
                "name": "batch_normalization_6",
                "trainable": true,
                "dtype": "float32",
                "axis": [
                    2
                ],
                "momentum": 0.99,
                "epsilon": 0.001,
                "center": true,
                "scale": true,
                "beta_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "gamma_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "moving_mean_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "moving_variance_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "beta_regularizer": null,
                "gamma_regularizer": null,
                "beta_constraint": null,
                "gamma_constraint": null
            },
            "name": "batch_normalization_6",
            "inbound_nodes": [
                [
                    [
                        "conv1d_6",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Dropout",
            "config": {
                "name": "dropout_6",
                "trainable": true,
                "dtype": "float32",
                "rate": 0.1,
                "noise_shape": null,
                "seed": null
            },
            "name": "dropout_6",
            "inbound_nodes": [
                [
                    [
                        "batch_normalization_6",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Conv1D",
            "config": {
                "name": "conv1d_7",
                "trainable": true,
                "dtype": "float32",
                "filters": 32,
                "kernel_size": [
                    15
                ],
                "strides": [
                    1
                ],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [
                    1
                ],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "VarianceScaling",
                    "config": {
                        "scale": 2.0,
                        "mode": "fan_in",
                        "distribution": "truncated_normal",
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": {
                    "class_name": "L1L2",
                    "config": {
                        "l1": 0.0,
                        "l2": 9.999999747378752e-05
                    }
                },
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "name": "conv1d_7",
            "inbound_nodes": [
                [
                    [
                        "dropout_6",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "BatchNormalization",
            "config": {
                "name": "batch_normalization_7",
                "trainable": true,
                "dtype": "float32",
                "axis": [
                    2
                ],
                "momentum": 0.99,
                "epsilon": 0.001,
                "center": true,
                "scale": true,
                "beta_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "gamma_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "moving_mean_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "moving_variance_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "beta_regularizer": null,
                "gamma_regularizer": null,
                "beta_constraint": null,
                "gamma_constraint": null
            },
            "name": "batch_normalization_7",
            "inbound_nodes": [
                [
                    [
                        "conv1d_7",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Dropout",
            "config": {
                "name": "dropout_7",
                "trainable": true,
                "dtype": "float32",
                "rate": 0.1,
                "noise_shape": null,
                "seed": null
            },
            "name": "dropout_7",
            "inbound_nodes": [
                [
                    [
                        "batch_normalization_7",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Add",
            "config": {
                "name": "add_2",
                "trainable": true,
                "dtype": "float32"
            },
            "name": "add_2",
            "inbound_nodes": [
                [
                    [
                        "dropout_7",
                        0,
                        0,
                        {}
                    ],
                    [
                        "add_1",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Conv1D",
            "config": {
                "name": "conv1d_8",
                "trainable": true,
                "dtype": "float32",
                "filters": 32,
                "kernel_size": [
                    15
                ],
                "strides": [
                    1
                ],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [
                    1
                ],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "VarianceScaling",
                    "config": {
                        "scale": 2.0,
                        "mode": "fan_in",
                        "distribution": "truncated_normal",
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": {
                    "class_name": "L1L2",
                    "config": {
                        "l1": 0.0,
                        "l2": 9.999999747378752e-05
                    }
                },
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "name": "conv1d_8",
            "inbound_nodes": [
                [
                    [
                        "add_2",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "BatchNormalization",
            "config": {
                "name": "batch_normalization_8",
                "trainable": true,
                "dtype": "float32",
                "axis": [
                    2
                ],
                "momentum": 0.99,
                "epsilon": 0.001,
                "center": true,
                "scale": true,
                "beta_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "gamma_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "moving_mean_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "moving_variance_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "beta_regularizer": null,
                "gamma_regularizer": null,
                "beta_constraint": null,
                "gamma_constraint": null
            },
            "name": "batch_normalization_8",
            "inbound_nodes": [
                [
                    [
                        "conv1d_8",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Dropout",
            "config": {
                "name": "dropout_8",
                "trainable": true,
                "dtype": "float32",
                "rate": 0.1,
                "noise_shape": null,
                "seed": null
            },
            "name": "dropout_8",
            "inbound_nodes": [
                [
                    [
                        "batch_normalization_8",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Conv1D",
            "config": {
                "name": "conv1d_9",
                "trainable": true,
                "dtype": "float32",
                "filters": 32,
                "kernel_size": [
                    15
                ],
                "strides": [
                    1
                ],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [
                    1
                ],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "VarianceScaling",
                    "config": {
                        "scale": 2.0,
                        "mode": "fan_in",
                        "distribution": "truncated_normal",
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": {
                    "class_name": "L1L2",
                    "config": {
                        "l1": 0.0,
                        "l2": 9.999999747378752e-05
                    }
                },
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "name": "conv1d_9",
            "inbound_nodes": [
                [
                    [
                        "dropout_8",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "BatchNormalization",
            "config": {
                "name": "batch_normalization_9",
                "trainable": true,
                "dtype": "float32",
                "axis": [
                    2
                ],
                "momentum": 0.99,
                "epsilon": 0.001,
                "center": true,
                "scale": true,
                "beta_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "gamma_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "moving_mean_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "moving_variance_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "beta_regularizer": null,
                "gamma_regularizer": null,
                "beta_constraint": null,
                "gamma_constraint": null
            },
            "name": "batch_normalization_9",
            "inbound_nodes": [
                [
                    [
                        "conv1d_9",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Dropout",
            "config": {
                "name": "dropout_9",
                "trainable": true,
                "dtype": "float32",
                "rate": 0.1,
                "noise_shape": null,
                "seed": null
            },
            "name": "dropout_9",
            "inbound_nodes": [
                [
                    [
                        "batch_normalization_9",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Add",
            "config": {
                "name": "add_3",
                "trainable": true,
                "dtype": "float32"
            },
            "name": "add_3",
            "inbound_nodes": [
                [
                    [
                        "dropout_9",
                        0,
                        0,
                        {}
                    ],
                    [
                        "add_2",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Concatenate",
            "config": {
                "name": "concatenate",
                "trainable": true,
                "dtype": "float32",
                "axis": -1
            },
            "name": "concatenate",
            "inbound_nodes": [
                [
                    [
                        "add_1",
                        0,
                        0,
                        {}
                    ],
                    [
                        "add_2",
                        0,
                        0,
                        {}
                    ],
                    [
                        "add_3",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Conv1D",
            "config": {
                "name": "conv1d_10",
                "trainable": true,
                "dtype": "float32",
                "filters": 64,
                "kernel_size": [
                    10
                ],
                "strides": [
                    1
                ],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [
                    1
                ],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "VarianceScaling",
                    "config": {
                        "scale": 2.0,
                        "mode": "fan_in",
                        "distribution": "truncated_normal",
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": {
                    "class_name": "L1L2",
                    "config": {
                        "l1": 0.0,
                        "l2": 9.999999747378752e-05
                    }
                },
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "name": "conv1d_10",
            "inbound_nodes": [
                [
                    [
                        "concatenate",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "BatchNormalization",
            "config": {
                "name": "batch_normalization_10",
                "trainable": true,
                "dtype": "float32",
                "axis": [
                    2
                ],
                "momentum": 0.99,
                "epsilon": 0.001,
                "center": true,
                "scale": true,
                "beta_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "gamma_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "moving_mean_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "moving_variance_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "beta_regularizer": null,
                "gamma_regularizer": null,
                "beta_constraint": null,
                "gamma_constraint": null
            },
            "name": "batch_normalization_10",
            "inbound_nodes": [
                [
                    [
                        "conv1d_10",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Dropout",
            "config": {
                "name": "dropout_10",
                "trainable": true,
                "dtype": "float32",
                "rate": 0.1,
                "noise_shape": null,
                "seed": null
            },
            "name": "dropout_10",
            "inbound_nodes": [
                [
                    [
                        "batch_normalization_10",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Conv1D",
            "config": {
                "name": "conv1d_11",
                "trainable": true,
                "dtype": "float32",
                "filters": 64,
                "kernel_size": [
                    10
                ],
                "strides": [
                    1
                ],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [
                    1
                ],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "VarianceScaling",
                    "config": {
                        "scale": 2.0,
                        "mode": "fan_in",
                        "distribution": "truncated_normal",
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": {
                    "class_name": "L1L2",
                    "config": {
                        "l1": 0.0,
                        "l2": 9.999999747378752e-05
                    }
                },
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "name": "conv1d_11",
            "inbound_nodes": [
                [
                    [
                        "dropout_10",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Conv1D",
            "config": {
                "name": "conv1d_12",
                "trainable": true,
                "dtype": "float32",
                "filters": 64,
                "kernel_size": [
                    10
                ],
                "strides": [
                    1
                ],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [
                    1
                ],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "VarianceScaling",
                    "config": {
                        "scale": 2.0,
                        "mode": "fan_in",
                        "distribution": "truncated_normal",
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": {
                    "class_name": "L1L2",
                    "config": {
                        "l1": 0.0,
                        "l2": 9.999999747378752e-05
                    }
                },
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "name": "conv1d_12",
            "inbound_nodes": [
                [
                    [
                        "concatenate",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "BatchNormalization",
            "config": {
                "name": "batch_normalization_11",
                "trainable": true,
                "dtype": "float32",
                "axis": [
                    2
                ],
                "momentum": 0.99,
                "epsilon": 0.001,
                "center": true,
                "scale": true,
                "beta_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "gamma_initializer": {
